# Introduction

In this notebook, I will try to analyze the Titanic Dataset and tentatively determine if passengerâ€™s chances of surviving the sinking ship is related to their gender, age or social class. Some of the interesting questions I want to answer at the end of this analysis are:
- Analyze the influence of social class in the survival. Do the chances of survival increase with social class?
- Are females more likely to survive than males?
- Are children more likely to survive than adults?

In [1]:
## Importing Libraries
import numpy as np
import pandas as pd 
import matplotlib.pyplot as plt
%matplotlib inline

In [3]:
## Load dataset
titanic_df = pd.read_csv("titanic-data.csv")

In [4]:
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
## check row and column count
print (titanic_df.shape)

(891, 12)

In [15]:
## group passengers by gender and count 
titanic_df.groupby('Sex').count()
titanic_df['total_by_gender'] = titanic_df.groupby(['Color'])['Value'].transform('count')

,PassengerId,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Sex,,,,,,,,,,,
female,314,314,314,314,261,314,314,314,314,97,312
male,577,577,577,577,453,577,577,577,577,107,577